.emacs.d/myconfig.org
#+TITLE: Emacs configuration
#+DESCRIPTION: An org-babel based emacs configuration
#+LANGUAGE: en
#+PROPERTY: results silent

* Font
#+BEGIN_SRC emacs-lisp
(set-frame-font "Source Code Variable 14" nil t)

;; Add linespacing
(setq-default line-spacing 6)
#+END_SRC
* General Settings

#+BEGIN_SRC emacs-lisp
;; Allow y and n instead of yes and no
(fset 'yes-or-no-p 'y-or-n-p)

;; Disable bell
(setq visible-bell 1)

;; Save backups in emacs-backups folder
(setq backup-directory-alist '(("." . "~/.emacs.d/backups")))
;; Disk space is cheap. Save lots.
(setq delete-old-versions -1)
(setq version-control t)
(setq vc-make-backup-files t)

;; Remove Toolbar
(tool-bar-mode -1)

;; Highlight Parenthesis
(show-paren-mode t)

;; Remove Scrollbar
(scroll-bar-mode -1)
#+END_SRC

* Theme

#+BEGIN_SRC emacs-lisp
(use-package nimbus-theme
  :ensure t)
#+END_SRC
* Plugins

#+BEGIN_QUOTE
which-key is a minor mode for Emacs that displays the key bindings following your currently entered incomplete command (a prefix) in a popup.
#+END_QUOTE

#+BEGIN_SRC emacs-lisp
(use-package which-key
  :ensure t
  :config (which-key-mode))
#+END_SRC
* Keybindings
** General Keybindings

#+BEGIN_SRC emacs-lisp
(global-set-key (kbd "<s-return>") 'toggle-frame-fullscreen)
#+END_SRC


